## 6. 데이터 선택(기본)

In [1]:
import pandas as pd
df = pd.read_csv('data.csv')
df

      name  age          city
0     John   25      New York
1     Jane   30   Los Angeles
2      Doe   22       Chicago
3    Alice   28       Houston
4      Bob   35       Phoenix
5  Charlie   40  Philadelphia
6      Eve   29   San Antonio

### Column 선택(label)

In [2]:
df['age']

0    25
1    30
2    22
3    28
4    35
5    40
6    29
Name: age, dtype: int64

### Column 선택(정수 index)

In [3]:
df.columns

Index(['name', 'age', 'city'], dtype='object')

In [4]:
df.columns[2]

'city'

In [ ]:
df[df.columns[1]] # df['age']와 같음

0    25
1    30
2    22
3    28
4    35
5    40
6    29
Name: age, dtype: int64

### 슬라이싱

In [ ]:
df['age'][0:3] # age 컬럼에서 0에서 2번 인덱스까지 데이터를 가져옴

0    25
1    30
2    22
Name: age, dtype: int64